{
    "displayName": "Possible Local Privilege Escalation via KrbRelayUp Tool (via audit) by SOC Prime Team, SBousseaden",
    "description": "KrbRelayUp - a universal no fix local privilege escalation in windows domain environments where LDAP signing is not enforced (the default settings). Author: SOC Prime Team, SBousseaden. Rule ID: 4506fdde-d36a-4711-b795-3b1c9488b01e. License: https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md. Reference: https://tdm.socprime.com/tdm/info/.",
    "severity": "high",
    "enabled": true,
    "query": "SecurityEvent | where (EventID == 4624 and AuthenticationPackageName =~ 'Kerberos' and LogonType == \"3\" and IpAddress =~ '127.0.0.1' and TargetUserSid endswith '-500') | extend AccountCustomEntity = TargetUserName | extend HostCustomEntity = Computer | extend IPCustomEntity = IpAddress",
    "queryFrequency": "PT30M",
    "queryPeriod": "PT30M",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "suppressionDuration": "PT2H30M",
    "suppressionEnabled": true,
    "tactics": [
        "CredentialAccess",
        "DefenseEvasion",
        "PrivilegeEscalation"
    ],
    "techniques": [
        "T1548",
        "T1558"
    ]
}